package JavaStart.HomeWork003;

public class Task1 {
    public static void main(String[] args) {
        int x = 10;
        int y = 12;
        int z = 3;

        x += y - x++ * z;       // результат даної операції становить  -8
//        z = --x – y * 5;        // синтаксична помилка результат операціїї не виведеться в консоль
        y /= x + 5 % z;         // результат даної операції становить   1
        z = x++ + y * 5;        // результат даної операції становить   70
        x = y - x++ * z;        // результат даної операції становить   -18


    }

}
//
//Є 3 змінні типу int x = 10, y = 12 та z = 3. Виконайте розрахунок результату таких операцій для цих змінних:
//        §  x += y – x++ * z;
//        §  z = --x – y * 5;
//        §  y /= x + 5 % z;
//        §  z = x++ + y * 5;
//        §  x = y – x++ * z;